# =========================================
# RESOLUÇÃO
# =========================================

LARGURA = 1024
ALTURA = 768

FPS = 60


# =========================================
# CORES PRINCIPAIS
# =========================================

PRETO = (0, 0, 0)

BRANCO = (220, 220, 220)

VERDE = (0, 255, 0)

VERDE_ESCURO = (0, 40, 0)

VERDE_NEON = (0, 255, 120)

VERMELHO = (255, 70, 70)

AZUL = (0, 180, 255)

AMARELO = (255, 220, 50)

CINZA = (40, 40, 40)


# =========================================
# CRT
# =========================================

CRT_ALPHA = 45

CRT_LINHA_ESPACO = 3

CRT_COR = (0, 35, 0)


# =========================================
# ANIMAÇÕES
# =========================================

VELOCIDADE_TEXTO = 1.2

VELOCIDADE_ATAQUE = 10

SHAKE_INTENSIDADE = 6

SHAKE_DURACAO = 10


# =========================================
# HUD
# =========================================

HUD_X = 40
HUD_Y = 40

HUD_LARGURA = 940
HUD_ALTURA = 680


# =========================================
# POSIÇÕES PERSONAGENS
# =========================================

POS_JOGADOR_X = 100
POS_JOGADOR_Y = 220

POS_INIMIGO_X = 650
POS_INIMIGO_Y = 220


# =========================================
# STAR WARS INTRO
# =========================================

INTRO_VELOCIDADE = 1.2

INTRO_INCLINACAO = 220

INTRO_ESPACAMENTO = 90


# =========================================
# BATALHA
# =========================================

DANO_CRITICO_MULTIPLICADOR = 2

CHANCE_CRITICO = 15

CHANCE_ESQUIVA = 10


# =========================================
# POÇÃO
# =========================================

CURA_MIN = 15

CURA_MAX = 25